STMicroelectronics/X-CUBE-NFC4/Drivers/CMSIS/Device/ST/STM32MP1xx/Source/Templates/gcc/startup_stm32mp15xx_revA.s
  .weak      PendSV_Handler
  .thumb_set PendSV_Handler,Default_Handler

  .weak      SysTick_Handler
  .thumb_set SysTick_Handler,Default_Handler

  .weak      RESERVED4_IRQHandler
  .thumb_set RESERVED4_IRQHandler,Default_Handler

  .weak      RESERVED90_IRQHandler
  .thumb_set RESERVED90_IRQHandler,Default_Handler

  .weak      RESERVED99_IRQHandler
  .thumb_set RESERVED99_IRQHandler,Default_Handler

  .weak      RESERVED142_IRQHandler
  .thumb_set RESERVED142_IRQHandler,Default_Handler

  .weak      RESERVED143_IRQHandler
  .thumb_set RESERVED143_IRQHandler,Default_Handler

  .weak      WWDG1_IRQHandler
  .thumb_set WWDG1_IRQHandler,Default_Handler

  .weak      PVD_AVD_IRQHandler                      
  .thumb_set PVD_AVD_IRQHandler,Default_Handler
                           
  .weak      TAMP_IRQHandler
  .thumb_set TAMP_IRQHandler,Default_Handler
     
  .weak      RTC_WKUP_ALARM_IRQHandler
  .thumb_set RTC_WKUP_ALARM_IRQHandler,Default_Handler
               
  .weak      RCC_IRQHandler                      
  .thumb_set RCC_IRQHandler,Default_Handler
                                            
  .weak      EXTI0_IRQHandler                    
  .thumb_set EXTI0_IRQHandler,Default_Handler
                                              
  .weak      EXTI1_IRQHandler                    
  .thumb_set EXTI1_IRQHandler,Default_Handler
                                             
  .weak      EXTI2_IRQHandler                    
  .thumb_set EXTI2_IRQHandler,Default_Handler
                                              
  .weak      EXTI3_IRQHandler                    
  .thumb_set EXTI3_IRQHandler,Default_Handler
                                              
  .weak      EXTI4_IRQHandler                    
  .thumb_set EXTI4_IRQHandler,Default_Handler
                                                                               
  .weak      DMA1_Stream0_IRQHandler
  .thumb_set DMA1_Stream0_IRQHandler,Default_Handler

  .weak      DMA1_Stream1_IRQHandler             
  .thumb_set DMA1_Stream1_IRQHandler,Default_Handler
                          
  .weak      DMA1_Stream2_IRQHandler             
  .thumb_set DMA1_Stream2_IRQHandler,Default_Handler
                       
  .weak      DMA1_Stream3_IRQHandler             
  .thumb_set DMA1_Stream3_IRQHandler,Default_Handler
                      
  .weak      DMA1_Stream4_IRQHandler             
  .thumb_set DMA1_Stream4_IRQHandler,Default_Handler
                          
  .weak      DMA1_Stream5_IRQHandler             
  .thumb_set DMA1_Stream5_IRQHandler,Default_Handler
                            
  .weak      DMA1_Stream6_IRQHandler             
  .thumb_set DMA1_Stream6_IRQHandler,Default_Handler
  
  .weak      ADC_IRQHandler                      
  .thumb_set ADC_IRQHandler,Default_Handler
                            
  .weak      FDCAN1_IT0_IRQHandler
  .thumb_set FDCAN1_IT0_IRQHandler,Default_Handler

  .weak      FDCAN2_IT0_IRQHandler
  .thumb_set FDCAN2_IT0_IRQHandler,Default_Handler

  .weak      FDCAN1_IT1_IRQHandler
  .thumb_set FDCAN1_IT1_IRQHandler,Default_Handler
                                              
  .weak      FDCAN2_IT1_IRQHandler
  .thumb_set FDCAN2_IT1_IRQHandler,Default_Handler

  .weak      FDCAN_CAL_IRQHandler
  .thumb_set FDCAN_CAL_IRQHandler,Default_Handler
                                                                                      
  .weak      EXTI5_IRQHandler
  .thumb_set EXTI5_IRQHandler,Default_Handler
                                      
  .weak      TIM1_BRK_IRQHandler
  .thumb_set TIM1_BRK_IRQHandler,Default_Handler
                    
  .weak      TIM1_UP_IRQHandler
  .thumb_set TIM1_UP_IRQHandler,Default_Handler
                  
  .weak      TIM1_TRG_COM_IRQHandler
  .thumb_set TIM1_TRG_COM_IRQHandler,Default_Handler
   
  .weak      TIM1_CC_IRQHandler                  
  .thumb_set TIM1_CC_IRQHandler,Default_Handler
                                     
  .weak      TIM2_IRQHandler                     
  .thumb_set TIM2_IRQHandler,Default_Handler
                                              
  .weak      TIM3_IRQHandler                     
  .thumb_set TIM3_IRQHandler,Default_Handler
                                              
  .weak      TIM4_IRQHandler                     
  .thumb_set TIM4_IRQHandler,Default_Handler
                                              
  .weak      I2C1_EV_IRQHandler                  
  .thumb_set I2C1_EV_IRQHandler,Default_Handler
                                               
  .weak      I2C1_ER_IRQHandler                  
  .thumb_set I2C1_ER_IRQHandler,Default_Handler
                                               
  .weak      I2C2_EV_IRQHandler                  
  .thumb_set I2C2_EV_IRQHandler,Default_Handler
                                              
  .weak      I2C2_ER_IRQHandler                  
  .thumb_set I2C2_ER_IRQHandler,Default_Handler

  .weak      SPI1_IRQHandler                     
  .thumb_set SPI1_IRQHandler,Default_Handler
                                             
  .weak      SPI2_IRQHandler                     
  .thumb_set SPI2_IRQHandler,Default_Handler
                                              
  .weak      USART1_IRQHandler                   
  .thumb_set USART1_IRQHandler,Default_Handler
                                            
  .weak      USART2_IRQHandler                   
  .thumb_set USART2_IRQHandler,Default_Handler
                                            
  .weak      USART3_IRQHandler                   
  .thumb_set USART3_IRQHandler,Default_Handler
                                           
  .weak      EXTI10_IRQHandler
  .thumb_set EXTI10_IRQHandler,Default_Handler
                                    
  .weak      RTC_TIMESTAMP_IRQHandler
  .thumb_set RTC_TIMESTAMP_IRQHandler,Default_Handler
                    
  .weak      EXTI11_IRQHandler
  .thumb_set EXTI11_IRQHandler,Default_Handler

  .weak      TIM8_BRK_IRQHandler
  .thumb_set TIM8_BRK_IRQHandler,Default_Handler
                   
